tap "caskformula/caskformula"
tap "dopplerhq/cli"
tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "sachaos/todoist"
tap "stripe/stripe-cli"
tap "withgraphite/tap"
tap "yoheimuta/protolint"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "bat"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "fastlane"
brew "fzf"
brew "gh"
brew "gnupg"
brew "jq"
brew "node"
brew "node@16"
brew "openjdk@11"
brew "peco"
brew "protobuf@3", link: true
brew "protolint"
brew "pyenv"
brew "python@3.10"
brew "rename"
brew "ripgrep"
brew "starship"
brew "thefuck"
brew "tmux"
brew "watchman"
brew "zlib"
brew "zsh-autosuggestions"
brew "dopplerhq/cli/doppler", link: false
brew "facebook/fb/idb-companion"
brew "mongodb/brew/mongodb-community"
brew "sachaos/todoist/todoist"
brew "stripe/stripe-cli/stripe"
brew "withgraphite/tap/graphite-beta"
cask "fig"
cask "flipper"
cask "font-fira-code"
cask "font-monaspace"
cask "inkscape"
cask "mongodb-compass"
cask "mongodb-realm-studio"
cask "orbstack"
cask "postman"
cask "rectangle"
cask "tunnelblick"
cask "visual-studio-code"
cask "wombat"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "apollographql.vscode-apollo"
vscode "astro-build.astro-vscode"
vscode "attilabuti.vscode-mjml"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "bruce.rona"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "graphite.gti-vscode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "iceyer.toml-formatter"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "nick-lvov-dev.typescript-explicit-types"
vscode "nicoespeon.abracadabra"
vscode "oderwat.indent-rainbow"
vscode "ovidijusparsiunas.condition-inverter"
vscode "planbcoding.vscode-react-refactor"
vscode "plex.vscode-protolint"
vscode "pomber.git-file-history"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.vscode-xml"
vscode "sdras.night-owl"
vscode "sidthesloth.html5-boilerplate"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "tobermory.es6-string-html"
vscode "tomrijndorp.find-it-faster"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "yatki.vscode-surround"
vscode "yoavbls.pretty-ts-errors"
vscode "yuichinukiyama.vscode-preview-server"
vscode "yzhang.markdown-all-in-one"
